app/controllers/cards_controller.rb

SELECT `cards`.* FROM `cards`
---
  def index
    @cards = Card.all

INSERT INTO `cards` (`created_at`, `description`, `subject`, `to`, `updated_at`) VALUES ('2015-02-17 12:53:37', '<p>zxczxc</p>\r\n', 'asd', 'anupriya@gmail.com', '2015-02-17 12:53:37')
---
  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save

UPDATE `cards` SET `description` = '<p><img alt=\"\" src=\"/ckeditor_assets/pictures/1/content_card-sample.png\" style=\"width: 480px; height: 289px;\" /></p>\r\n', `updated_at` = '2015-02-17 13:31:15' WHERE `cards`.`id` = 1
---
  def update
    respond_to do |format|
      if @card.update(card_params)

SELECT  `cards`.* FROM `cards`  WHERE `cards`.`id` = 1 LIMIT 1
---
    def set_card
      @card = Card.find(params[:id])