app/controllers/dashboards_controller.rb

	def fetch_user_detail
	  @list_user = User.where(email: params[:search]).uniq
---
SELECT DISTINCT `users`.* FROM `users`  WHERE (email ='dhandayudhapani.b@calsoftlabs.com')