app/controllers/dashboards_controller.rb

	def fetch_user_detail
		search_input = params[:search].split(",").uniq
  		@list_user = User.where(email: search_input)
---
SELECT `users`.* FROM `users`  WHERE (email ='dhandayudhapani.b@calsoftlabs.com')

    def set_user
      @user = User.find(params[:search])
---
SELECT `users`.* FROM `users`  WHERE (fname like '%anu%' or email like '%anu%' or lname like '%anu%' or emp_id like '%anu%')