app/controllers/users_controller.rb

	def index
		# @user_email = User.all.uniq.map(&:email)
		@user = User.all
---
SELECT `users`.* FROM `users`  WHERE (fname=NULL and lname=NULL and email=NULL and emp_id=NULL)